"""
Начало курса на YouTube itProger.

"""

print("Hello itProger!")

print("Результат: ", 7, 15, sep="|", end="!\n") # sep= - разделитель значений; end= - вывод элемента в конце; \n - переход на новую строку

print("Second line")

# математические вычисления

# возведение в степень с помощью **
print("Результат:", 5 ** 2)

# деление и округление до целого числа с помощью //
print("Результат:", 5 // 2)

print("Результат мин.:", min(5, 6, 3, 0, 2, -3, 5)) # выводит минимальное значение 

print("Результат макс.:", max(5, 6, 3, 0, 2, -3, 5)) # выводит максимальное значение 

# округление результата до целого значения с помощь. round
print("Результат:", round(5 / 3))

# получение данных от пользлвателя с помощью imput
input("Введите свой возраст: ")
